//
// Created by Андрей Понамарчук on 2019-08-21.
//

#ifndef ALGORITHMS_LESSON3_H
#define ALGORITHMS_LESSON3_H

#endif //ALGORITHMS_LESSON3_H

#include "../Utils/Utils.h"

//Урок 3. Поиск в массиве. Простые сортировки
void lesson3();

/*1. Попробовать оптимизировать пузырьковую сортировку. Сравнить количество операций сравнения оптимизированной
 * и не оптимизированной программы. Написать функции сортировки, которые возвращают количество операций.*/
void lesson3Ex1();

//2. *Реализовать шейкерную сортировку.
void lesson3Ex2();

/*3. Реализовать бинарный алгоритм поиска в виде функции, которой передается отсортированный массив.
 * Функция возвращает индекс найденного элемента или -1, если элемент не найден.*/
void lesson3Ex3();

//4. *Подсчитать количество операций для каждой из сортировок и сравнить его с асимптотической сложностью алгоритма.
void lesson3Ex4();