//
// Created by Андрей Понамарчук on 2019-08-18.
//

#ifndef ALGORITHMS_LESSON2_H
#define ALGORITHMS_LESSON2_H

#endif //ALGORITHMS_LESSON2_H

#include "../Utils/Utils.h"
//Урок 2. Асимптотическая сложность алгоритма. Рекурсия

void lesson2();

/*1. Реализовать функцию перевода из 10 системы в двоичную используя рекурсию.*/
void lesson2Ex1();

/*2. Реализовать функцию возведения числа a в степень b:
 * a. без рекурсии;
 * b. рекурсивно;
 * c. *рекурсивно, используя свойство чётности степени.*/
void lesson2Ex2();

/* **Исполнитель «Калькулятор» преобразует целое число, записанное на экране. У исполнителя две команды,
 * каждой присвоен номер:
 *      1. Прибавь 1.
 *      2. Умножь на 2.
 * Первая команда увеличивает число на экране на 1, вторая увеличивает его в 2 раза.
 * Определить, сколько существует программ, которые преобразуют число 3 в число 20:
 *      а. С использованием массива.
 *      b. *С использованием рекурсии.
*/
void lesson2Ex3();