//
// Created by Андрей Понамарчук on 2019-08-14.
//

#ifndef ALGORITHMS_LESSON1_H
#define ALGORITHMS_LESSON1_H

#endif //ALGORITHMS_LESSON1_H

#include "../Utils/Utils.h"
//Алгоритмы и структуры данных. Простые алгоритмы

void lesson1();

/*14. * Автоморфные числа. Натуральное число называется автоморфным, если оно равно последним цифрам своего квадрата.
 * Например, pow(25,2) = 625. Напишите программу, которая получает на вход натуральное число N
 * и выводит на экран все автоморфные числа, не превосходящие N.*/
void lesson1Ex14();
/*13. * Написать функцию, генерирующую случайное число от 1 до 100.
        -с использованием стандартной функции rand()
        -без использования стандартной функции rand()*/
void lesson1Ex13();

/*12. Написать функцию нахождения максимального из трех чисел.*/
void lesson1Ex12();

/*11. С клавиатуры вводятся числа, пока не будет введен 0.
 * Подсчитать среднее арифметическое всех положительных четных чисел, оканчивающихся на 8.*/
void lesson1Ex11();

/*10. Дано целое число N (> 0). С помощью операций деления нацело и взятия остатка от деления определить,
 * имеются ли в записи числа N нечетные цифры. Если имеются, то вывести True, если нет — вывести False.*/
void lesson1Ex10();

/*9. Даны целые положительные числа N и K. Используя только операции сложения и вычитания,
 * найти частное от деления нацело N на K, а также остаток от этого деления.*/
void lesson1Ex9();

/*8. Ввести a и b и вывести квадраты и кубы чисел от a до b.*/
void lesson1Ex8();

/*7. С клавиатуры вводятся числовые координаты двух полей шахматной доски (x1,y1,x2,y2).
 * Требуется определить, относятся ли к поля к одному цвету или нет.*/
void lesson1Ex7();

