//
// Created by Андрей Понамарчук on 2019-08-14.
//

#ifndef ALGORITHMS_LESSON1_H
#define ALGORITHMS_LESSON1_H

#endif //ALGORITHMS_LESSON1_H

#include <stdio.h>
#include <math.h>

//Алгоритмы и структуры данных. Простые алгоритмы

/*14. * Автоморфные числа. Натуральное число называется автоморфным, если оно равно последним цифрам своего квадрата.
 * Например, pow(25,2) = 625. Напишите программу, которая получает на вход натуральное число N
 * и выводит на экран все автоморфные числа, не превосходящие N.*/
void ex14();