//
// Created by Андрей Понамарчук on 27/08/2019.
//

#ifndef ALGORITHMS_LESSON4_H
#define ALGORITHMS_LESSON4_H

#endif //ALGORITHMS_LESSON4_H

#include "../Utils/Utils.h"

//Урок 4. Динамическое программирование. Поиск возвратом

void lesson4();

/*. *Количество маршрутов с препятствиями. Реализовать чтение массива с препятствием и нахождение количество маршрутов.

Например, карта:
3 3
1 1 1
0 1 0
0 1 0*/
void lesson4Ex1();

/*2. Решить задачу о нахождении длины максимальной последовательности с помощью матрицы.*/
void lesson4Ex2();

/*3. ***Требуется обойти конём шахматную доску размером NxM, пройдя через все поля доски по одному разу.
 * Здесь алгоритм решения такой же как и в задаче о 8 ферзях. Разница только в проверке положения коня.*/
//результат неверен
void lesson4Ex3();