//
// Created by Андрей Понамарчук on 02/09/2019.
//

#ifndef ALGORITHMS_LESSON6_H
#define ALGORITHMS_LESSON6_H

#endif //ALGORITHMS_LESSON6_H

#include "../Utils/Utils.h"

//Урок 6. Деревья

void lesson6();

/*1. Реализовать простейшую хэш-функцию. На вход функции подается строка, на выходе сумма кодов символов.*/
void lesson6Ex1();

/*2. Переписать программу, реализующее двоичное дерево поиска.
 * а) Добавить в него обход дерева различными способами;
 * б) Реализовать поиск в двоичном дереве поиска;
 * в) *Добавить в программу обработку командной строки с помощью которой можно указывать
 *  из какого файла считывать данные, каким образом обходить дерево.*/
void lesson6Ex2();

/*3. *Разработать базу данных студентов из двух полей “Имя”, “Возраст”, “Табельный номер”
 * в которой использовать все знания, полученные на уроках.
 *
 * Считайте данные в двоичное дерево поиска. Реализуйте поиск по какому-нибудь полю базы данных (возраст, вес)*/
void lesson6Ex3();
