//
// Created by Андрей Понамарчук on 29/08/2019.
//

#ifndef ALGORITHMS_LESSON5_H
#define ALGORITHMS_LESSON5_H

#endif //ALGORITHMS_LESSON5_H

#include "../Utils/Utils.h"

//Урок 4. Динамические структуры данных

void lesson5();

/*1. Реализовать перевод из 10 в 2 систему счисления с использованием стека.*/
void lesson5Ex1();

/*2. Добавить в программу “реализация стека на основе односвязного списка” проверку на выделение памяти.
 * Если память не выделяется, то выводится соответствующее сообщение.
 * Постарайтесь создать ситуацию, когда память не будет выделяться (добавлением большого количества данных).*/
void lesson5Ex2();

/*3. Написать программу, которая определяет, является ли введенная скобочная последовательность правильной.
 * Примеры правильных скобочных выражений: (), ([])(), {}(), ([{}]),
 * неправильных — )(, ())({), (, ])}), ([(]) для скобок [,(,{.

Например: (2+(2*2)) или [2/{5*(4+7)}]*/
void lesson5Ex3();

/*4. *Создать функцию, копирующую односвязный список (то есть создает в памяти копию односвязного списка, без удаления первого списка).*/
void lesson5Ex4();

/*5. **Реализовать алгоритм перевода из инфиксной записи арифметического выражения в постфиксную.*/
void lesson5Ex5();

/*6. *Реализовать очередь.*/
void lesson5Ex6();